{
    "name":"Vaibhav Katariya",
    "birthday":"1989-11-23T00:05:32.000Z",
    "email":"vaibhav.katariya085@gmail.com",
    "job": "Lead Engineer",
    "phone": "+91-9582184180, +91-7906067058", 
    "skypeId":"live:vaibhav.katariya085",
    "linkedin":"https://in.linkedin.com/in/vaibhav-katariya-25051271",
    "address":"Flat - 203, Sunrise Aurora Apartment, 1, Hoskote Rd, Nagondanahalli, Whitefield, Bengaluru, Karnataka, 560066",
    "userImage":"/my_pic.png",
    "description":"<p>Hi, I’m Vaibhav Katariya, but most people call me <strong>‘Vibhu.’</strong></p> <p>I am currently working as a <strong>Lead Engineer</strong> at <strong>Epam Systems Pvt. Ltd.</strong>, bringing over 10 years of experience in the IT industry as a software engineer. Throughout my career, I have designed, developed, and optimized high-performance web and mobile applications across diverse technologies and industries.</p><p>My core expertise lies in MEAN/MERN stack development, coupled with cloud computing on AWS and DigitalOcean, where I focus on building scalable, secure, and efficient solutions. Beyond my primary stack, I am deeply passionate about emerging technologies such as Data Science, Artificial Intelligence (AI), Machine Learning (ML), and Augmented/Virtual Reality (AR/VR). I constantly seek opportunities to innovate, explore new tech trends, and enhance user experiences through cutting-edge solutions.</p> <p>With a strong problem-solving mindset, I thrive in fast-paced environments, mentoring teams, and driving impactful projects that bridge technology with real-world applications.</p>",
    "services":"<p>In addition to my full-time role, I take on freelance projects, helping businesses build scalable, AI-driven, and efficient tech solutions. With a proven track record, I have successfully delivered 10+ applications across various industries, including e-commerce, education, fintech, and enterprise solutions.</p><p>I offer end-to-end development support with expertise in modern web, mobile, cloud, and AI technologies: <ul><li>✅ Frontend: React.js, Next.js, Vue.js, Nuxt.js, Angular, Svelte, Solid.js, PWA, Microfrontends</li><li>✅ Backend: Node.js (Express.js, Fastify, Nest.js), PHP (Laravel, CodeIgniter), Python (Django, Flask), Java (Spring Boot)</li><li>✅ Mobile Development: React Native, Flutter (Dart)</li><li>✅ Databases: MongoDB, PostgreSQL, MySQL, DynamoDB, Firebase</li><li>✅ Cloud & DevOps: AWS (Lambda, S3, API Gateway, EC2, ECS, EKS, CloudFront, IAM, SES, SNS, CloudFormation, DynamoDB, RDS), DigitalOcean, Heroku, Docker, Kubernetes, CI/CD (GitHub Actions, Jenkins, GitLab CI)</li><li>✅ AI & Machine Learning: Experience integrating AI tools & models, working with C3.ai, OpenAI APIs, AWS AI/ML services, and building intelligent applications</li><li>✅ Third-Party Integrations: Payment gateways (Stripe, Razorpay, PayPal), Authentication (OAuth, Firebase Auth, AWS Cognito), WebSockets, GraphQL, REST APIs</li></ul></p><p>I have worked with startups, enterprises, and SaaS businesses, delivering robust, future-ready solutions. If you're looking for a skilled and reliable developer to bring your vision to life, let’s connect! I’d love to collaborate and help your business grow. 🚀</p>",
    "history": [
        {
            "working_history":[
                {
                    "job_title":"Lead Engineer",
                    "company_name":"Epam Systems Pvt. Ltd.",
                    "job_location":"Bengaluru (Karnataka)",
                    "job_description":"Designed scalable AI-driven architectures while leading and mentoring the UI team. Developed REST APIs using the C3 Type System and built a high-performance React frontend. Collaborated with cross-functional teams to deliver AI-powered solutions for the energy sector.",
                    "start_date":"22 Sep, 2022",
                    "end_date":"Present"
            },
            {
                "job_title":"Sr. Engineering Lead",
                "company_name":"Accion Labs Pvt. Ltd.",
                "job_location":"Bengaluru (Karnataka)",
                "job_description":"Led a UI team (4-7 members) while actively contributing as an individual developer. Developed Student Relationship Management (SRM) & Guided Pathways for Students (GPS) to enhance student engagement and career opportunities. Built web & mobile applications (Android & iOS) and integrated UI components with REST APIs for seamless marketplace functionality.",
                "start_date":"1 Apr, 2022",
                "end_date":"20 Sep, 2022"
        },
                  {
                    "job_title":"Technical lead",
                    "company_name":"Accion Labs Pvt. Ltd.",
                    "job_location":"Bengaluru (Karnataka)",
                    "job_description":"",
                    "start_date":"1 Apr, 2021",
                    "end_date":"31 Mar, 2022"
            },
                 {
                    "job_title":"Sr. Software developer",
                    "company_name":"Accion Labs Pvt. Ltd.",
                    "job_location":"Bengaluru (Karnataka)",
                    "job_description":"",
                    "start_date":"16 Jun, 2018",
                    "end_date":"31 May, 2021"
            },
                 {
                    "job_title":"Software developer",
                    "company_name":"WalkingTree Technology Pvt. Ltd.",
                    "job_location":"Hyderabad (Telangana)",
                    "job_description":"Led UI development for multiple projects using React.js and JavaScript. Developed the E-Government CRM portal for the Maharashtra Government, improving citizen services. Built and integrated the Tailorman e-commerce marketplace with Node.js microservices, streamlining the online tailoring experience. Contributed to the Legal Case Management System, handling UI development, REST API integration, and backend services. Worked with an 8-member team to deliver scalable and efficient solutions.",
                    "start_date":"13 Nov, 2017",
                    "end_date":"1 June 2018"
            },
                  {
                    "job_title":"Software developer",
                    "company_name":"E-Smart Systems Pvt. Ltd.",
                    "job_location":"New Delhi (Delhi)",
                    "job_description":"Developed business hybrid applications (Loan a Device, Parking App, Register Visitor, Contractor) using the Dreamscape platform (.NET). Designed and built UI components, integrating applications with SQL Server via .NET workflows. Collaborated with an 8-member team, working closely with offshore clients to ensure seamless project execution.",
                    "start_date":"23 Nov, 2016",
                    "end_date":"7 Nov, 2017"
            },
                {
                    "job_title":"Sr. UI developer",
                    "company_name":"Vinkom Solutions Pvt. Ltd.",
                    "job_location":"Gurugram (Haryana)",
                    "job_description":"Designed, developed, and maintained UI for e-commerce applications on Magento 2 and built custom WordPress web applications for online directories. Modified plugins, fixed UI bugs, and optimized frontend performance. Designed UX for web, Android, and iOS applications, along with creating HTML emailers, social media creatives, and marketing assets. Implemented On-page & Off-page SEO to enhance site visibility.",
                    "start_date":"23 May, 2016",
                    "end_date":"22 Nov, 2016"
            },
             {
                    "job_title":"Sr. FullStack PHP developer",
                    "company_name":"Crux Creative Solutions Pvt. Ltd.",
                    "job_location":"Gurugram (Haryana)",
                    "job_description":"Developed PHP-based web applications for event organizing agencies, leading a team of 2-3 developers to ensure smooth project execution. Implemented On-page & Off-page SEO strategies to boost product visibility and optimized marketing mailers for campaigns.",
                    "start_date":"15 Oct, 2015",
                    "end_date":"20 May, 2016"
            },
            {
                    "job_title":"Web designer/UI developer",
                    "company_name":"Vidyamantra edu system pvt.ltd.",
                    "job_location":"Gr. Noida (Uttar Pradesh)",
                    "job_description":"Designed and developed custom Moodle themes, upgrading and optimizing legacy themes for compatibility with newer versions. Built and customized responsive UI components and managed Linux server configurations for seamless deployment and performance optimization.",
                    "start_date":"5 May, 2014",
                    "end_date":"13 Oct, 2015"
            }
        ],
            "educational_history":[
                {
                    "course_pursue":"B.tech (CSE)",
                    "college_name":"Dev Bhoomi Institute of technology",
                    "location":"Dehradun (Uttarakhand)",
                    "description": "",
                    "start_date": "2009",
                    "end_date": "2013"
                },
                {
                    "course_pursue":"12th (PCMC)",
                    "college_name":"Raja Ram Mohan Roy Academy",
                    "location":"Dehradun (Uttarakhand)",
                    "description":"",
                    "start_date":"2007",
                    "end_date":"2009"
                },
                {
                    "course_pursue":"10th (PCMCB)",
                    "college_name":"St. Thomas Convent School",
                    "location":"Pauri Garhwal (Uttarakhand)",
                    "description":"",
                    "start_date":"2006",
                    "end_date":"2007"
                }
            ]
        }
    ],
    "resume":{
        "pdf_format":"/Vaibhav_Resume_Updated_On_27-4-2022.pdf"
    }
}